import type { Component } from "solid-js";
import Nav from "./components/Nav";
import Cookie from "./components/Cookie";

const App: Component = () => {
  return (
    <>
      <Nav />
      <div class="flex h-screen place-content-center">
        <div class="flex h-full flex-col max-w-screen-lg">
          <section class="bg-blue-200 text-center">
            <div class="p-2 text-5xl text-center my-6">เว็บชังชาติ</div>
            <img
              src="/assets/tahlufah.jpg"
              alt="ทะลุฟ้า"
              class="mx-auto w-1/3"
            ></img>
            <p class="mx-16 my-4">
              Lorem ipsum dolor sit amet consectetur adipisicing elit. Deleniti,
              minima, molestias placeat ut expedita consequuntur repellat totam
              harum in dolorum eum nulla voluptatum error ullam atque pariatur
              corporis optio amet.
            </p>
            <ul class="p-4">
              <li>วิธีหนีจากประเทศนี้</li>
              <li>passport ถูกกฎหมาย</li>
              <li>Silk road passport</li>
            </ul>
          </section>
          <section class="bg-red-200">
            <div class="text-2xl text-center my-4">
              ไทย 88 ปี บนเส้นทางประชาธิปไตยหลังปฏิวัติสยาม
            </div>
            <p class="p-4">
              กลุ่มบุคคลในนาม คณะราษฎร ซึ่งนำโดยพระยาพหลพลพยุหเสนา
              ยึดอำนาจการปกครองแผ่นดินและเปลี่ยนแปลงการปกครองจากระบอบสมบูรณาญาสิทธิราชย์ในรัชสมัยของพระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัว
              รัชกาลที่ 7 มาสู่ระบอบราชาธิปไตยภายใต้รัฐธรรมนูญและปกครองโดยรัฐสภา
              การยึดอำนาจเปลี่ยนแปลงการปกครองในครั้งนั้นไม่มีการเสียเลือดเนื้อ
            </p>
          </section>
          <section class="bg-emerald-100">
            <div class="text-2xl text-center my-4">ประกาศคณะราษฎร</div>
            <img
              src="/assets/prakad.jpg"
              alt="คณะราษฎร"
              class="mx-auto w-1/3"
            />
            <p class="p-4">
              ราษฎรทั้งหลาย
              เมื่อกรัตริย์องค์นี้ได้ครองราชสมบัดิสืบจากพระเชษฐานั้น ในชั้นต้น
              ราษฎรบางคนได้หวังกันว่า
              กษัตริย์องค์ใหม่นี้คงจะปกครองราษฎรให้ร่มเย็น
              แต่การก็หาได้เป็นไปตามที่คิดหวังไม่
              กษัตริย์คงทรงอำนาจเหนือกฎหมายอยู่ตามเดิม
              ทรงแต่งตั้งญาติวงศ์และคนสอพลอไร้คุณความรู้ให้ดำรงตำแหน่งที่สำคัญ ๆ
              ไม่ทรงฟังเสียงราษฎร ปล่อยให้ข้าราชการใช้อำนาจหน้าที่ในทางทุจริต
              มีการรับสินบนในการก่อสร้าง ซื้อของใช้ในราชการ
              หากำไรในการเปลี่ยนราคาเงิน ผลาญเงินของประเทศ
              ยกพวกเจ้าขึ้นให้สิทธิพิเศษมากกว่าราษฎร กดขี่ข่มเหงราษฎร
              ปกครองโดยขาดหลักวิชชา ปล่อยให้บ้านเมืองเป็นไปตามยถากรรม
              ดั่งที่จะเห็นได้จากความตกต่ำในทางเศรษฐกิจและความฝืดเคืองในการทำมาหากิน
              ซึ่งพวกราษฎรได้รู้กันอยู่ทั่วไปแล้ว
              รัฐบาลของกษัตริย์เหนือกฎหมายมิสามารถแก้ไขให้ฟื้นขึ้นได้
              การที่แก้ไขไม่ได้
              ก็เพราะรัฐบาลของกษัตริย์นี้มิได้ปกครองประเทศเพื่อราษฎรตามที่รัฐบาลอื่น
              ๆ ได้กระทำกัน รัฐบาลของกษัตริย์ได้ถือเอาราษฎรเป็นทาส (ซึ่งเรียกว่า
              ไพร่ บ้าง ข้า บ้าง) เป็นสัตว์เดรฉานไม่นึกว่าเป็นมนุษย์
              เหตุฉะนั้นแทนที่จะช่วยราษฎรกลับพากันทำนาบนหลังราษฎร จะเห็นได้ว่า
              ภาษีอากรที่บีบคั้นเอามาจากราษฎรนั้น
              กษัตริย์ได้หักเอาไว้ใช้ส่วนตัวปีหนึ่งเป็นจำนวนหลายล้าน
              ส่วนราษฎรสิกว่าจะหาได้แม้แต่เล็กน้อยแทบเลือดตากระเด็น
              ถึงคราวเสียเงินราชการหรือภาษีใด
              ถ้าไม่มีเงินรัฐบาลก็ยึดทรัพย์หรือใช้งานโยธา
              แต่พวกเจ้ากลับนอนกินกันเป็นสุข
              ไม่มีประเทศใดในโลกจะให้เงินเจ้ามากเช่นนี้
              นอกจากพระเจ้าซาร์และพระเจ้าไกเซอร์เยอรมัน
              ซึ่งชนชาตินั้นก็ได้โค่นราชบัลลังก์เสียแล้ว
              รัฐบาลของกษัตริย์ได้ปกครองอย่างหลอกลวงไม่ซื่อตรงต่อราษฎร
              มีเป็นต้นว่า หลอกว่าจะบำรุงการทำมาหากินอย่างโน้นอย่างนี้
              แต่ครั้นคอย ๆ ก็เหลวไปหาได้ทำจริงจังไม่
              มิหนำซ้ำกล่าวคำหมิ่นประมาทราษฎรผู้มีบุญคุณเสียภาษีอากรให้พวกเจ้าได้กินว่า
              ราษฎรยังมีเสียงทางการเมืองไม่ได้ เพราะราษฎรยังโง่
              คำพูดของพวกรัฐบาลเช่นนี้ใช้ไม่ได้ ถ้าราษฎรโง่ เจ้าก็โง่
              เพราะเป็นคนชาติเดียวกัน ที่ราษฎรรู้เท่าไม่ถึงเจ้านั้น
              ไม่ใช่เพราะโง่
              เป็นเพราะขาดการศึกษาที่พวกเจ้าปกปิดไว้ไม่ให้เรียนเต็มที่
              เพราะเกรงว่า เมื่อราษฎรได้มีการศึกษา
              ก็จะรู้ความชั่วร้ายที่พวกเจ้าทำไว้
              และคงจะไม่ยอมให้เจ้าทำนาบนหลังคน ราษฎรทั้งหลายพึงรู้เถิดว่า
              ประเทศเรานี้เป็นของราษฎร ไม่ใช่ของกษัตริย์ตามที่เขาหลอกลวง
              บรรพบุรุษของราษฎรเป็นผู้ช่วยกันกู้ให้ประเทศมีอิสสรภาพพ้นมือจากข้าศึก
              พวกเจ้ามีแต่จะชุบมือเปิบและกวาดรวบทรัพย์สมบัติเข้าไว้ตั้งหลายร้อยล้าน
              เงินเหล่านี้เอามาจากไหน ?
              ก็เอามาจากราษฎรเพราะวิธีทำนาบนหลังคนนั้นเอง
              บ้านเมืองกำลังอัตคัดฝืดเคือง
              ชาวนาและพ่อแม่ทหารต้องทิ้งนาเพราะทำไม่ได้ผล รัฐบาลไม่บำรุง
              รัฐบาลไล่คนงานออกอย่างเกลื่อนกลาด
              นักเรียนเรียนเสร็จแล้วและทหารปลดกองหนุนแล้วไม่มีงานทำ
              จะต้องอดอยากไปตามยถากรรม
              เหล่านี้เป็นผลของรัฐบาลของกษัตริย์เหนือกฎหมาย
              บีบคั้นข้าราชการชั้นผู้น้อย
              นายสิบและเสมียนเมื่อให้ออกจากงานแล้วก็ไม่ให้เบี้ยบำนาญ
              ความจริงควรเอาเงินที่กวาดรวบรวมไว้มาจัดบำรุงบ้านเมืองให้มีงานทำ
              จึ่งจะสมควรที่สนองคุณราษฎรซึ่งได้เสียภาษีอากรให้พวกเจ้าได้ร่ำรวยมานาน
              แต่พวกเจ้าก็หาได้ทำอย่างใดไม่ คงสูบเลือดกันเรื่อย ๆ ไป
              เงินมีเหลือเท่าใดก็เอาฝากต่างประเทศ
              คอยเตรียมหนีเมื่อบ้านเมืองซุดโทรม ปล่อยให้ราษฎรอดอยาก
              การเหล่านี้ย่อมชั่วร้าย เหตุฉะนั้น ราษฎร
              ข้าราชการทหารและพลเรือนที่รู้เท่าถึงการกระทำอันชั่วร้ายของรัฐบาลดังกล่าวแล้ว
              จึ่งรวมกำลังตั้งเป็นคณะราษฎรขึ้น
              และได้ยึดอำนาจของรัฐบาลของกษัตริย์ไว้ได้แล้ว คณราษฎรเห็นว่า
              การที่จะแก้ความชั่วร้ายนี้ได้ ก็โดยที่จะต้องจัดการปกครองโดยมีสภา
              จะได้ช่วยกันปรึกษาหารือหลาย ๆ ความคิด ดีกว่าความคิดเดียว
              ส่วนผู้เป็นประมุขของประเทศนั้น
              คณะราษฎรไม่ประสงค์ทำการแย่งชิงราชสมบัติ ฉะนั้น
              จึ่งได้ขอเชิญให้กษัตริย์องค์นี้ดำรงค์ตำแหน่งกษัตริย์ต่อไป
              แต่จะต้องอยู่ใต้กฎหมายธรรมนูญการปกครองแผ่นดิน
              จะทำอะไรโดยลำพังไม่ได้ นอกจากด้วยความเห็นชอบของสภาผู้แทนราษฎร
              คณะราษฎรได้แจ้งความประสงค์นี้ให้กษัตริย์ทราบแล้ว
              เวลานี้ยังอยู่ในความรับตอบ
              ถ้ากษัตริย์ตอบปฏิเสธหรือไม่ตอบภายในกำหนดโดยเห็นแก่ส่วนตนว่าจะถูกลดอำนาจลงมา
              ก็จะได้ชื่อว่าทรยศต่อชาติ
              และก็เป็นการจำเป็นที่ประเทศจะต้องมีการปกครองแบบอย่างประชาธิปตัย
              กล่าวคือ
              ประมุขของประเทศจะเป็นบุคคลสามัญซึ่งสภาผู้แทนราษฎรได้เลือกตั้งขึ้นอยู่ในตำแหน่งตามกำหนดเวลา
              ตามวิธีนี้ ราษฎรพึงหวังเถิดว่า ราษฎรจะได้รับความบำรุงอย่างดีที่สุด
              ทุก ๆ คนจะมีงานทำ
              เพราะประเทศของเราเป็นประเทศที่อุดมอยู่แล้ว–ตามสภาพ
              เมื่อเราได้ยึดเงินที่พวกเจ้ารวบรวมไว้จากการทำนาบนหลังคนตั้งหลายร้อยล้านมาบำรุงประเทศขึ้นแล้ว
              ประเทศจะต้องเฟื่องฟูขึ้นเป็นแม่นมั่น
              การปกครองซึ่งคณะราษฎรจะพึงกระทำก็คือ จำต้องวางโครงการ
              อาศัยหลักวิชชา
              ไม่ทำไปเสมือนคนตาบอดเช่นรัฐบาลที่มีกษัตริย์เหนือกฎหมายทำมาแล้ว
              เป็นหลักใหญ่ ๆ ที่คณะราษฎรวางไว้ มีอยู่ว่า ๑
              จะต้องรักษาความเป็นเอกราชทั้งหลาย เช่น เอกราชในทางการเมือง
              ในทางศาล ในทางเศรษฐกิจ ฯ ล ฯ ของประเทศไว้ให้มั่นคง ๒
              จะต้องรักษาความปลอดภัยภายในประเทศ
              ให้การประทุษฐร้ายต่อกันลดน้อยลงให้มาก ๓
              จะต้องบำรุงความสุขสมบูรณ์ของราษฎรในทางเศรษฐกิจ
              โดยรัฐบาลใหม่จะหางานให้ราษฎรทุกคนทำ จะวางโครงการเศรษฐกิจแห่งชาติ
              ไม่ปล่อยให้ราษฎรอดอยาก ๔ จะต้องให้ราษฎรมีสิทธิเสมอภาคกัน
              (ไม่ใช่ให้พวกเจ้ามีสิทธิยิ่งกว่าราษฎรเช่นที่เป็นอยู่) ๕
              จะต้องให้ราษฎรได้มีเสรีภาพ มีความเป็นอิสสระ
              เมื่อเสรีภาพนี้ไม่ขัดต่อหลัก ๔ ประการดั่งกล่าวข้างต้น ๖
              จะต้องให้การศึกษาอย่างเต็มที่แก่ราษฎร ราษฎรทั้งหลาย
              จงพร้อมใจกันช่วยคณะราษฎรให้ทำกิจอันจะคงอยู่ชั่วดินฟ้านี้ให้สำเร็จ
              คณะราษฎรขอให้ทุกคนที่มิได้ร่วมมือเข้ายึดอำนาจจากรัฐบาลกษัตริย์เหนือกฎหมายพึงตั้งตนอยู่ในความสงบ
              และตั้งหน้าทำมาหากิน อย่าทำการใด ๆ อันเป็นการขัดขวางต่อคณะราษฎร
              การที่ราษฎรช่วยคณะราษฎรนี้เท่ากับราษฎรช่วยประเทศ และช่วยตัวราษฎร
              บุตร หลาน เหลน ของตนเอง ประเทศจะมีความเป็นเอกราชอย่างพร้อมบูรณ์
              ราษฎรจะได้รับความปลอดภัย ทุกคนจะต้องมีงานทำไม่ต้องอดตาย
              ทุกคนจะมีสิทธิเสมอกัน และมีเสรีภาพพ้นจากการเป็นไพร่
              เป็นข้าเป็นทาสของพวกเจ้า หมดสมัยที่เจ้าจะทำนาบนหลังราษฎร
              สิ่งที่ทุกคนพึงปรารถนา คือความสุขความเจริญอย่างประเสริฐ
              ซึ่งเรียกกันเป็นศัพท์ว่า "ศรีอาริย" นั้น
              ก็จะพึงบังเกิดขึ้นแก่ราษฎรถ้วนหน้า
            </p>
          </section>
          <section class="bg-yellow-200">
            <div class="text-2xl text-center my-4">มาตรา 112</div>
            <p class="p-4">
              อัตราโทษจำคุก 3-15 ปีนั้นนับว่า "สูงที่สุด"
              เมื่อเทียบกับกฎหมายลักษณะเดียวกันในประเทศที่ปกครองด้วยระบอบประชาธิปไตยอันมีพระมหากษัตริย์เป็นประมุข
              (Constitutional Monarchy)
              ซึ่งแม้จะมีบางประเทศที่กำหนดโทษไว้ใกล้เคียงกับไทย
              แต่ในทางปฏิบัติไม่มีการนำมาใช้จำกัดสิทธิเสรีภาพของประชาชนมานานนับศตวรรษแล้ว
              และอัตราโทษจำคุกต่ำสุด 3 ปี ก็ยัง "สูงเกินไป"
              จนทำให้คดีที่เป็นเรื่องเล็กน้อย
              ศาลไม่อาจใช้ดุลพินิจกำหนดบทลงโทษให้น้อยกว่านี้ได้
              นอกจากนี้เมื่อเทียบอัตราโทษมาตรา 112
              กับอัตราโทษฐานหมิ่นประมาทบุคคลกลุ่มอื่นตามกฎหมายของประเทศไทยเองก็ยังมีโทษ
              "รุนแรงเกินไป" อย่างไม่ได้สัดส่วน
            </p>
          </section>
        </div>
      </div>
      <Cookie></Cookie>
    </>
  );
};

export default App;
