[
  "พระบาทสมเด็จพระบรมราชาธิราชรามาธิบดี ศรีสินทรบรมมหาจักรพรรดิราชาธิบดินทร์ ธรณินทราธิราช รัตนากาศภาษกรวงษ์ องค์บรมาธิเบศ ตรีภูวเนตรวรนายก ดิลกรัตนราชชาติอาชาวไศรย สมุทัยดโรมนต์ สกลจักรวาฬาธิเบนทร์ สุริเยนทราธิบดินทร์ หริหรินทราธาดาธิบดี ศรีวิบูลยคุณอักนิษฐ ฤทธิราเมศวรมหันต์ บรมธรรมิกราชาธิราชเดโชไชยพรหมเทพาดิเทพนฤบดินทร ภูมินทรบรมาธิเบศโลกเชฐวิสุทธิ รัตนมกุฏประเทศคตา มหาพุทธางกูรบรมบพิตร",
  "พระบาทสมเด็จพระบรมราชาธิราชรามาธิบดี ศรีสินทรบรมมหาจักรพรรดิราชาธิบดินทร์ ธรณินทราธิราช รัตนากาศภาสกรวงศ์ องค์ปรมาธิเบศ ตรีภูวเนตรวรนายก ดิลกรัตนราชชาติอาชาวศรัย สมุทัยดโรมนต์ สากลจักรวาฬาธิเบนทร สุริเยนทราธิบดินทร์ หริหรินทรา ธาดาธิบดี ศรีวิบูลยคุณอกนิษฐ ฤทธิราเมศวรมหันต บรมธรรมิกราชาธิราชเดโชชัย พรหมเทพาดิเทพนฤบดินทร์ ภูมิทรปรมาธิเบศ โลกเชษฐวิสุทธิ รัตนมกุฎประกาศ คตามหาพุทธางกูรบรมบพิตร พระพุทธเจ้าอยู่หัว",
  "พระบาทสมเด็จพระบรมราชาธิราชรามาธิบดี ศรีสินทรบรมมหาจักรพรรดิราชาธิบดินทร์ ธรณินทราธิราช รัตนากาศภาสกรวงศ์ องค์ปรมาธิเบศร์ ตรีภูวเนตรวรนายก ดิลกรัตนราชชาติอาชาวไสย สมุทัยดโรมน สากลจักรวาลาธิเบนทร์ สุริเยนทราธิบดินทร์ หริหรินทราธาธิบดี ศรีสุวิบูลย คุณอถพิษฐ ฤทธิราเมศวร ธรรมิกราชาธิราช เดโชชัย พรหมเทพาดิเทพนฤบดินทร์ ภูมินทรปรมาธิเบศร โลกเชษฐวิสุทธิ มงกุฏประเทศคตา มหาพุทธางกูร บรมบพิตร พระพุทธเจ้าอยู่หัว",
  "พระบาทสมเด็จพระปรเมนทรมหามงกุฎสุทธิ สมมุติเทพยพงศวงศาดิศรกษัตริย์ วรขัตติยราชนิกโรดม จาตุรันตบรมมหาจักรพรรดิราชสังกาศ อุภโตสุชาติสังสุทธิเคราะหณี จักรีบรมนาถ อดิศวราชรามวรังกูร สุจริตมูลสุสาธิตอุกฤษฐวิบูลย บุรพาดูลยกฤษฎาภินิหารสุภาธิการรังสฤษดิ ธัญญลักษณ วิจิตรโสภาคสรรพางค์ มหาชโนตมางคประนตบาทบงกชยุคคล ประสิทธิสรรพสุภผลอุดม บรมสุขุมาลยมหาบุรุษยรัตน ศึกษาพิพัฒนสรรพโกศล สุวิสุทธิวิมลศุภศีลสมาจารย์ เพ็ชรญาณประภาไพโรจน์ อเนกโกฏิสาธุ คุณวิบุลยสันดาน ทิพยเทพวตาร ไพศาลเกียรติคุณอดุลยพิเศษ สรรพเทเวศรานุรักษ์เอกอัครมหาบุรุษ สุตพุทธมหากระวี ตรีปิฎกาทิโกศล วิมลปรีชามหาอุดมบัณฑิต สุนทรวิจิตรปฏิภาณ บริบูรณ์คุณสาร สัสยามาทิโลกยดิลก มหาปริวารนายกอนันต์ มหันตวรฤทธิเดช สรรพพิเศษ สิรินธรมหาชนนิกรสโมสรสมมติ ประสิทธิวรยศมโหดมบรมราชสมบัติ นพปดลเศวตฉัตราดิฉัตร สิริรัตโนปลักษณมหาบรมราชาภิเศกาภิษิต สรรพทศทิศวิชิตวิไชย สกลมไหศวรินมหาสยามินทร มเหศวรมหินทร มหาราชาวโรดม บรมนารถชาติอาชาวศรัย พุทธาทิไตรรัตนสรณารักษ์ อุกฤษฐศักดิอัครนเรศราธิบดี เมตตากรุณาสีตลหฤทัย อโนปมัยบุญการสกลไพศาลมหารัษฎาธิเบนทร ปรเมนทรธรรมมิกมหาราชาธิราช บรมนารถบรมบพิตร พระจอมเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระปรมินทรมหาจุฬาลงกรณ์ บดินทรเทพยมหามงกุฏ บุรุษยรัตนราชรวิวงศ์ วรุตมพงศบริพัตร วรขัติยราชนิกโรดม จาตุรันตบรมมหาจักรพรรดิราชสังกาศ อุภโตสุชาติสังสุทธเคราะหณี จักรีบรมนาถ มหามงกุฎราชวรางกูร สุจริตมูลสุสาธิต อรรคอุกฤษฏไพบูลย์ บุรพาดูลย์กฤษฎาภินิหาร สุภาธิการรังสฤษดิ์ ธัญลักษณวิจิตร โสภาคยสรรพางค์ มหาชโนตมางคประณต บาทบงกชยุคล ประสิทธิสรรพศุภผลอุดมบรมสุขุมมาลย์ ทิพยเทพาวตารไพศาลเกียรติคุณอดุลยพิเศษ สรรพเทเวศรานุรักษ์ วิสิษฐศักดิ์สมญาพินิตประชานาถ เปรมกระมลขัติยราชประยูร มูลมุขมาตยาภิรมย์ อุดมเดชาธิการ บริบูรณ์คุณสารสยามาทินครวรุตเมกราชดิลก มหาปริวารนายกอนันต์มหันตวรฤทธิเดช สรรพวิเศษสิรินธร อเนกชนนิกรสโมสรสมมติ ประสิทธิ์วรยศมโหดมบรมราชสมบัติ นพปฎลเศวตฉัตราดิฉัตร สิริรัตโนปลักษณมหาบรมราชาภิเษกาภิลิต สรรพทศทิศวิชิตชัย สกลมไหศวริยมหาสวามินทร์ มเหศวรมหินทรมหารามาธิราชวโรดม บรมนาถชาติอาชาวศรัย พุทธาทิไตรรัตนสรณารักษ์ อดุลยศักดิ์อรรคนเรศราธิบดี เมตตากรุณาสีตลหฤทัย อโนปมัยบุญการ สกลไพศาลมหารัษฎาธิบดินทร ปรมินทรธรรมิกหาราชาธิราช บรมนาถบพิตร พระจุลจอมเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระปรเมนทรมหาวชิราวุธ เอกอรรคมหาบุรุษบรมนราธิราช พินิตประชานารถมหาสมมตวงษ์ อดิศัยพงษวิมลรัตน์ วรขัตติยราชนิกโรดม จาตุรันตบรมมหาจักรพรรดิราชสังกาศ อุภโตสุชาตสังสุทธเคราะหณี จักรีบรมนาถ จุฬาลงกรณราชวรางกูร บรมมกุฏนเรนทรสูรสันตติวงษวิสิฐ สุสาธิตบุรพาธิการ อดุลยกฤษฎาภินิหารอดิเรกบุญฤทธิ ธัญลักษณวิจิตรโสภาคยสรรพางค์ มหาชโนตมางคประณตบาทบงกชยุคล ประสิทธิสรรพศุภผลอุดมบรมสุขุมาลย์ ทิพยเทพาวตารไพศาลเกียรติคุณอดุลยพิเศษ สรรพเทเวศรานุรักษ์ บุริมศักดิสมญาเทพวาราวดี ศรีมหาบุรุษสุตสมบัติ เสนางคนิกรรัตน์อัศวโกศล ประพนธปรีชามัทวสมาจาร บริบูรณ์คุณสารสยามาทินครวรุตเมกราชดิลก มหาปริวารนายกอนันต์ มหันตวรฤทธิเดช สรรพวิเศษศิรินธร บรมชนกาดิศรสมมต ประสิทธิวรยศมโหดมบรมราชสมบัติ นพปฎลเสวตฉัตราดิฉัตร ศิริรัตโนปลักษณมหาบรมราชาภิเศกาภิสิต สรรพทศทิศวิชิตไชย สกลมไหศวริยมหาสวามินทร์ มเหศวรมหินทรมหารามาธิราชวโรดม บรมนารถชาติอาชาวศรัย พุทธาทิไตรรัตนสรณารักษ์ อดุลยศักดิ์อรรคนเรศรามาธิบดี เมตตากรุณาสีตลหฤไทย อโนปไมยบุญการ สกลไพศาลมหารัษฎาธิบดินทร์ ปรเมนทรธรรมิกมหาราชาธิราช บรมนารถบพิตร พระมงกุฏเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระปรมินทรมหาประชาธิปก มหันตเดชนดิลกรามาธิบดี เทพยปรียามหาราชรวิวงศ์ อสัมภินพงศพีระกษัตรบุรุษรัตนราชนิกโรดม จาตุรันตบรมมหาจักรพรรดิราชสังกาศ อุภโตสุชาตสังสุทธเคราะหณี จักรีบรมนาถจุฬาลงกรณราชวรางกูร มหมกุฏวงศวีรสูรชิษฐ ราชธรรมทศพิธ อุต์กฤษฎานิบุณย์อดุลยฤษฎาภินิหาร บูรพาธิการสุสาธิต ธันยลักษณ์วิจิตรเสาวภาคยสรรพางค์ มหาชโนตมางคมานท สนธิมตสมันตสมาคม บรมราชสมภาร ทิพยเทพวตารไพศาลเกียรติคุณ อดุลยศักดิเดช สรรพเทเวศปริยานุรักษ์ มงคลลคนเนมาหวัยสุโขทัยธรรมราชา อภิเนาวศิลปศึกษาเดชาวุธ วิชัยยุทธศาสตร์โกศล วิมลนรรยพินิต สุจริตสมาจาร ภัทรภิชญาณประดิภานสุนทร ประวรศาสโนปสุดมภก มูลมุขมาตยวรนายกมหาเสนานี สราชนาวีพยูหโยธโพยมจร บรมเชษฏโสทรสมมต เอกราชยยศสธิคมบรมราชสมบัติ นพปฏลเศวตฉัตราดิฉัตร ศรีรัตโนปลักษณมหาบรมราชาภิเษกาภิศิกต์ สรรพทศทิศวิชิตเดโชไชย สกลมไหศวรยมหาสยามินทร มเหศวรมหินทรมหารามาธิราชวโรดม บรมนาถชาติอาชาวศรัย พุทธาธิไตรรัตนวิศิษฎศักดิ์อัครนเรศวราธิบดี เมตตากรุณาศีตลหฤทัย อโนปไมยบุณยการ สกลไพศาลมหารัษฎราธิบดินทร์ ปรมินทรธรรมิกมหาราชาธิราช บรมนาถบพิตร พระปกเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระปรเมนทรมหาอานันทมหิดล อดุลยเดชวิมลรามาธิบดี จุฬาลงกรณราชปรียวรนัดดา มหิตลานเรศวรางกูร ไอศูรยสันตติวงศวิสุทธ์ วรุตมขัตติยศักตอรรคอุดม จักรีบรมราชวงศนิวิฐ ทศพิธราชธรรมอุกฤษฎนิบุณ อดุลยกฤษฎาภินิหารรังสฤษฎ์ สุสาธิตบูรพาธิการ ไพศาลเกียรติคุณอดุลยพิเศษ สรรพเทเวศรานุรักษ์ ธัญอรรคลักษณวิจิตรโสภาคยสรรพางค์ มหาชโนตมงคประณตบาทบงกชยุคล อเนกนิกรชนสโมสรสมมต ประสิทธิวรยศมโหดมบรมราชสมบัติ นพปฎลเศวตฉัตราดิฉัตร สรรพรัฐทศทิศวิชิตไชย สกลมไหศวริยมหาสวามินทร มเหศวรมหินทรมหารามาธิราชวโรดม บรมนาถชาติอาชาวไศรย พุทธาทิไตรรัตน สรณารักษ์วิศิษฎศักตอัครนเรศรามาธิบดี พระอัฐมรามาธิบดินทร สยามินทราธิราชบรมนาถบพิตร",
  "พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช มหิตลาธิเบศรามาธิบดี จักรีนฤบดินทร สยามมินทราธิราช บรมนาถบพิตร",
  "พระบาทสมเด็จพระปรเมนทรรามาธิบดี ศรีสินทรมหาวชิราลงกรณมหิศรภูมิพลราชวรางกูร กิติสิริสมบูรณอดุลยเดช สยามินทราธิเบศรราชวโรดม บรมนาถบพิตร พระวชิรเกล้าเจ้าอยู่หัว",
  "สมเด็จพระเจ้าลูกยาเธอ เจ้าฟ้าวชิราลงกรณ บรมจักรยาดิศรสันตติวงศ เทเวศรธำรง สุบริบาล อภิคุณูประการมหิตลาดุลเดช ภูมิพลนเรศวรางกูร กิตติสิริสมบูรณ์สวางควัฒน์ บรมขัตติยราชกุมาร",
  "พระบาทสมเด็จพระพุทธยอดฟ้าจุฬาโลกมหาราช",
  "พระบาทสมเด็จพระพุทธเลิศหล้านภาลัย",
  "พระบาทสมเด็จพระนั่งเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระจอมเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระจึลจอมเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระมงกุฎเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัว",
  "พระบาทสมเด็จพระเจ้าอยู่หัวอานันทมหิดล",
  "พระบาทสมเด็จพระเจ้าอยู่หัวภูมิพลอดุลยเดช",
  "สมเด็จพระเจ้าอยู่หัวมหาวชิราลงกรณ บดินทรเทพยวรากูร",
  "รัชกาลที่ 1",
  "รัชกาลที่ 2",
  "รัชกาลที่ 3",
  "รัชกาลที่ 4",
  "รัชกาลที่ 5",
  "รัชกาลที่ 6",
  "รัชกาลที่ 7",
  "รัชกาลที่ 8",
  "รัชกาลที่ 9",
  "รัชกาลที่ 10",
  "รัชกาลที่ ๑",
  "รัชกาลที่ ๒",
  "รัชกาลที่ ๓",
  "รัชกาลที่ ๔",
  "รัชกาลที่ ๕",
  "รัชกาลที่ ๖",
  "รัชกาลที่ ๗",
  "รัชกาลที่ ๘",
  "รัชกาลที่ ๙",
  "รัชกาลที่ ๑๐"
]